In [1]:
import pandas as pd
adult = pd.read_csv('/Users/ecuerbo/Desktop/data/adult.csv')
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education.num   32561 non-null  int64
 5   marital.status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital.gain    32561 non-null  int64
 11  capital.loss    32561 non-null  int64
 12  hours.per.week  32561 non-null  int64
 13  native.country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [2]:
adult_dtypes = {
    "workclass" : "category",
    "education" : "category",
    "relationship":'category',
    'marital.status':'category',
    'income':"category",
    "sex":"category"
}

adult=pd.read_csv(
    '/Users/ecuerbo/Desktop/data/adult.csv',
    dtype=adult_dtypes)
print(adult.dtypes)

age                  int64
workclass         category
fnlwgt               int64
education         category
education.num        int64
marital.status    category
occupation          object
relationship      category
race                object
sex               category
capital.gain         int64
capital.loss         int64
hours.per.week       int64
native.country      object
income            category
dtype: object

In [3]:
adult[adult["occupation"]=='Farming-fishing'][['native.country', 'sex', 'income']].value_counts()

native.country  sex     income
United-States   Male    <=50K     711
                        >50K      109
Mexico          Male    <=50K      72
United-States   Female  <=50K      57
?               Male    <=50K       5
Puerto-Rico     Male    <=50K       4
Philippines     Male    <=50K       4
Mexico          Female  <=50K       3
Guatemala       Female  <=50K       2
Vietnam         Male    <=50K       2
Canada          Male    <=50K       2
Italy           Male    <=50K       2
Cuba            Male    <=50K       2
United-States   Female  >50K        2
El-Salvador     Male    <=50K       2
Mexico          Male    >50K        2
Guatemala       Male    <=50K       2
Puerto-Rico     Female  <=50K       1
England         Male    <=50K       1
Poland          Male    <=50K       1
Portugal        Male    <=50K       1
France          Male    <=50K       1
Germany         Male    <=50K       1
Cambodia        Male    >50K        1
Japan           Male    <=50K       1
Ireland         Male    <=50K       1
Hong            Male    <=50K       1
Yugoslavia      Male    >50K        1
dtype: int64

In [4]:
adult[adult['workclass']=='Never-worked'][['sex','income','native.country']].value_counts()

sex     income  native.country
Male    <=50K   United-States     5
Female  <=50K   United-States     2
dtype: int64

In [5]:
adult['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

In [6]:
adult.groupby(by=['income']).mean()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
income,,,,,,
<=50K,36.783738,190340.86517,9.595065,148.752468,53.142921,38.840210
>50K,44.249841,188005.00000,11.611657,4006.142456,195.001530,45.473026

In [7]:
adult[adult['native.country']=='Philippines'][['sex','income']].value_counts(normalize=True)

sex     income
Male    <=50K     0.383838
Female  <=50K     0.308081
Male    >50K      0.247475
Female  >50K      0.060606
dtype: float64

In [8]:
adult[['sex','income']].value_counts()

sex     income
Male    <=50K     15128
Female  <=50K      9592
Male    >50K       6662
Female  >50K       1179
dtype: int64

In [9]:
adult[['income','relationship']].value_counts()

income  relationship
<=50K   Not-in-family     7449
        Husband           7275
>50K    Husband           5918
<=50K   Own-child         5001
        Unmarried         3228
        Other-relative     944
>50K    Not-in-family      856
<=50K   Wife               823
>50K    Wife               745
        Unmarried          218
        Own-child           67
        Other-relative      37
dtype: int64

In [16]:
adult.shape

(32561, 15)

In [18]:
adult.describe()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [19]:
adult.values

array([[90, '?', 77053, ..., 40, 'United-States', '<=50K'],
       [82, 'Private', 132870, ..., 18, 'United-States', '<=50K'],
       [66, '?', 186061, ..., 40, 'United-States', '<=50K'],
       ...,
       [40, 'Private', 154374, ..., 40, 'United-States', '>50K'],
       [58, 'Private', 151910, ..., 40, 'United-States', '<=50K'],
       [22, 'Private', 201490, ..., 20, 'United-States', '<=50K']],
      dtype=object)

In [22]:
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education.num',
       'marital.status', 'occupation', 'relationship', 'race', 'sex',
       'capital.gain', 'capital.loss', 'hours.per.week', 'native.country',
       'income'],
      dtype='object')

In [26]:
a=adult.columns.values
print(a)

['age' 'workclass' 'fnlwgt' 'education' 'education.num' 'marital.status'
 'occupation' 'relationship' 'race' 'sex' 'capital.gain' 'capital.loss'
 'hours.per.week' 'native.country' 'income']